of222/tutorials/rheoFoam/OtherTests/tube_GNF/powerLaw/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       9440;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       9480;
    }
    walls
    {
        type            wall;
        nFaces          120;
        startFace       9520;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       9640;
    }
    wFront
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          4800;
        startFace       9640;
    }
    wBack
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          4800;
        startFace       14440;
    }
)

// ************************************************************************* //
